"Dismiss" = "Отклонить";
"Images that arrive on your iPhone through Mover are automatically saved to the camera roll inside your iPhone's Pictures application." = "Изображения, которые прибыли на Ваш iPhone через Mover, автоматически сохраняются в Фотографиях.";
"An image has been received. It has been saved automatically." = "Получено новое изображение. Сохранено автоматически.";
